; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 473291 2 2 2 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(have_image Phenomenon3 thermograph0)
	(have_image Planet4 thermograph0)
	(have_image Phenomenon5 thermograph1)
	(have_image Star6 thermograph0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 star0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
4. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 0 of 6
7. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 0 of 6
8. (turn_to satellite0 star6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
9. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 0 of 6
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
11. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 1 of 6
12. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 1 of 6
13. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
14. (turn_to satellite1 planet4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet4)
   goals met: 1 of 6
15. (take_image satellite0 planet8 instrument0 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 2 of 6
16. (turn_to satellite1 planet7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 planet7)
   goals met: 2 of 6
17. (turn_to satellite0 planet4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet4)
   goals met: 2 of 6
18. (turn_to satellite1 phenomenon5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 6
19. (take_image satellite0 planet4 instrument0 thermograph0)
   added: (have_image planet4 thermograph0)
   goals met: 3 of 6
20. (turn_to satellite1 planet7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet7)
   goals met: 3 of 6
21. (turn_to satellite0 phenomenon3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon3)
   goals met: 3 of 6
22. (turn_to satellite1 phenomenon5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 6
23. (take_image satellite0 phenomenon3 instrument0 thermograph0)
   added: (have_image phenomenon3 thermograph0)
   goals met: 4 of 6
24. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   goals met: 4 of 6
25. (turn_to satellite0 planet7 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 planet7)
   goals met: 4 of 6
26. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 4 of 6
27. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 5 of 6
28. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 6
29. (take_image satellite1 phenomenon5 instrument1 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 6 of 6
